Revit 2027 API
AnalyticalMember.SetReleaseType Method
 Sets the release type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetReleaseType(
	bool start,
	ReleaseType releaseType
)
Public Sub SetReleaseType (
	start As Boolean,
	releaseType As ReleaseType
)
public:
void SetReleaseType(
	bool start,
	ReleaseType releaseType
)
member SetReleaseType :
        start : bool *
        releaseType : ReleaseType -> unit
Parameters
start Boolean
 The position on Analytical Member element. True for start, false for end.
releaseType ReleaseType
 The type of release.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace